/**
  ******************************************************************************
  * @file    fytpi_protocol.h
  * @author  Brosy
  * @brief   通信协议
  * @date    2021-08-28
  ******************************************************************************
  * @attention 包括minipc、陀螺仪和遥控器串口协议，电机CAN协议
  *
  * Copyright (c) CSU_RM_FYT.
  * All rights reserved.
  *
  * This software component is licensed by Brosy under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  * opensource.org/licenses/BSD-3-Clause
  ******************************************************************************
  *修改记录：
  *<时间>      |<版本>      |<作者>      |<描述>     
  *2021-08-28  |v1.0        |Brosy       |首次发布
  ******************************************************************************
**/
  
/* includes ------------------------------------------------------------------*/
#include <stdint.h>
 
/* define --------------------------------------------------------------------*/

/* typedef -------------------------------------------------------------------*/

/* variables -----------------------------------------------------------------*/

/* function ------------------------------------------------------------------*/

